import { readLines } from './index.ts';

const FILE_PATH = "./ch12/ex05/toshishun.txt";

describe('readLines', () => {
    const firstLine20 = [
        "杜子春",
        "芥川龍之介",
        "",
        "-------------------------------------------------------",
        "【テキスト中に現れる記号について】",
        "",
        "《》：ルビ",
        "（例）或《ある》",
        "",
        "｜：ルビの付く文字列の始まりを特定する記号",
        "（例）都｜洛陽《らくよう》",
        "",
        "［＃］：入力者注　主に外字の説明や、傍点の位置の指定",
        "（例）［＃５字下げ］",
        "-------------------------------------------------------",
        "",
        "［＃５字下げ］一［＃「一」は中見出し］",
        "",
        "　或《ある》春の日暮です。",
        "　唐《とう》の都｜洛陽《らくよう》の西の門の下に、ぼんやり空を仰いでいる、一人の若者がありました。",
    ];

    const lastLine20 = [
        "「もしお前が黙っていたら、おれは即座にお前の命を絶ってしまおうと思っていたのだ。――お前はもう仙人になりたいという望《のぞみ》も持っていまい。大金持になることは、元より愛想がつきた筈《はず》だ。ではお前はこれから後、何になったら好《い》いと思うな」",
        "「何になっても、人間らしい、正直な暮しをするつもりです」",
        "　杜子春の声には今までにない晴れ晴れした調子が罩《こも》っていました。",
        "「その言葉を忘れるなよ。ではおれは今日限り、二度とお前には遇《あ》わないから」",
        "　鉄冠子はこう言う内に、もう歩き出していましたが、急に又足を止めて、杜子春の方を振り返ると、",
        "「おお、幸《さいわい》、今思い出したが、おれは泰山《たいざん》の南の麓《ふもと》に一軒の家を持っている。その家を畑ごとお前にやるから、早速行って住まうが好い。今頃は丁度家のまわりに、桃の花が一面に咲いているだろう」と、さも愉快そうにつけ加えました。",
        "",
        "",
        "",
        "底本：「蜘蛛の糸・杜子春」新潮文庫、新潮社",
        "　　　1968（昭和43）年11月15日発行",
        "　　　1989（平成元）年5月30日46刷",
        "初出：「赤い鳥」",
        "　　　1920（大正9）年7月号",
        "入力：蒋龍",
        "校正：noriko saito",
        "2005年1月7日作成",
        "2013年10月29日修正",
        "青空文庫作成ファイル：",
        "このファイルは、インターネットの図書館、青空文庫（http://www.aozora.gr.jp/）で作られました。入力、校正、制作にあたったのは、ボランティアの皆さんです。",
    ];

    test("すべての行が正しく取得できる", () => {
        const r = readLines(FILE_PATH);
        const lines: string[] = [];
        for (const line of r) {
            lines.push(line);
        }
        // 最初の20行をチェック
        for (let i = 0; i < 20; i++) {
            expect(lines[i]).toEqual(firstLine20[i]);
        }

        // 最後の20行も正しく取得できることもチェック
        for (let i = 0; i < 20; i++) {
            expect(lines[lines.length - 20 + i]).toBe(lastLine20[i]);
        }
    });

    test("途中でbreakするとファイルがクローズ", () => {
        const r = readLines(FILE_PATH);
        let firstLine = "";
        try {
            for (const line of r) {
                firstLine = line;
                break;
            }
        } catch (e) {
        }
        expect(firstLine).toBe("杜子春");

        // ファイルを閉じているため、再度ファイルを開ける
        const r2 = readLines(FILE_PATH);
        expect(r2.next().value).toBe("杜子春");
    });

    test("途中でthrowするとファイルがクローズ", () => {
        const r = readLines(FILE_PATH);
        expect(() => {
            for (const line of r) {
                throw new Error();
            }
        }).toThrow();

        // ファイルを閉じているため、再度ファイルを開ける
        const r2 = readLines(FILE_PATH);
        expect(r2.next().value).toBe("杜子春");
    });

    test("存在しないファイルを開くとエラーになる", () => {
        expect(() => {
            const r = readLines("error.txt");
            r.next();
        }).toThrow();
    });
});